archives/2024/Results/Verifications/S2427/bottleneck-determination/point_select/threads-28/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=28 oltp_point_select --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-ty
pe=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 28
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 28 tps: 13016.41 qps: 13016.41 (r/w/o: 13016.41/0.00/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 28 tps: 14035.09 qps: 14035.09 (r/w/o: 14035.09/0.00/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 28 tps: 14737.65 qps: 14737.65 (r/w/o: 14737.65/0.00/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 28 tps: 15251.12 qps: 15251.12 (r/w/o: 15251.12/0.00/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 28 tps: 15271.02 qps: 15271.02 (r/w/o: 15271.02/0.00/0.00) lat (ms,95%): 4.57 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 28 tps: 15645.13 qps: 15645.13 (r/w/o: 15645.13/0.00/0.00) lat (ms,95%): 4.41 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 28 tps: 15182.23 qps: 15182.23 (r/w/o: 15182.23/0.00/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 28 tps: 15077.71 qps: 15077.71 (r/w/o: 15077.71/0.00/0.00) lat (ms,95%): 4.33 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 28 tps: 14814.17 qps: 14814.17 (r/w/o: 14814.17/0.00/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 28 tps: 13380.47 qps: 13380.47 (r/w/o: 13380.47/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1464200
        write:                           0
        other:                           0
        total:                           1464200
    transactions:                        1464200 (14640.61 per sec.)
    queries:                             1464200 (14640.61 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0071s
    total number of events:              1464200

Latency (ms):
         min:                                    0.65
         avg:                                    1.91
         max:                                  294.85
         95th percentile:                        4.74
         sum:                              2798635.16

Threads fairness:
    events (avg/stddev):           52292.8571/243.25
    execution time (avg/stddev):   99.9513/0.00


real    1m40.116s
user    0m23.007s
sys     0m39.522s